# Introduction to Data Warehouses

Pagila is a sample database that is used to demonstrate the use of PostgreSQL. It is a port of the Sakila sample database for MySQL. The Pagila database is a DVD rental store database. It contains information about the store's inventory, staff, and customers. It was provided by Udacity as part of the Data Engineering course.  

Originally, pagila was in 3NF, like this:  

<img src="../../images/pagila-3nf.png"  width="600">  

As always, we start by importing the necessary libraries and setting some variables.

In [1]:
# Load extension
%load_ext sql

# Import libraries
from dotenv import dotenv_values
import pandas as pd
import psycopg2 as pg
from sqlalchemy import create_engine
from sqlalchemy.engine.base import Engine
from sqlalchemy.sql import text

In [2]:
# Load environment variables
config = dotenv_values()

# DB_INFO
DB_INFO = {
    'path': config['DB_PATH'],
    'host': config['DB_HOST'],
    'port': config['DB_PORT'],
    'database': config['DB_NAME'],
    'user': config['DB_USER'],
    'password': config['DB_PASS']
}

In [3]:
# Create the database when running for the first time
# by uncommenting the following lines

# !PGPASSWORD={DB_INFO["password"]} {DB_INFO["path"]}/createdb -h {DB_INFO["host"]} -U {DB_INFO["user"]} {DB_INFO["database"]}
# !PGPASSWORD={DB_INFO["password"]} {DB_INFO["path"]}/psql -q -h {DB_INFO["host"]} -U {DB_INFO["user"]} -d {DB_INFO["database"]} -f ../../data/pagila-0.10.1/pagila-schema.sql
# !PGPASSWORD={DB_INFO["password"]} {DB_INFO["path"]}/psql -q -h {DB_INFO["host"]} -U {DB_INFO["user"]} -d {DB_INFO["database"]} -f ../../data/pagila-0.10.1/pagila-data.sql

In [4]:
# Create connection strings for SQL magic and SQLAlchemy
CONNECTION_STRING = f"postgresql://{DB_INFO['user']}:{DB_INFO['password']}@{DB_INFO['host']}:{DB_INFO['port']}/{DB_INFO['database']}"
ENGINE_STRING = f"postgresql+psycopg2://{DB_INFO['user']}:{DB_INFO['password']}@{DB_INFO['host']}:{DB_INFO['port']}/{DB_INFO['database']}"

### Connection and Check
#### With SQL

In [5]:
# Connect to the database via SQL
%sql $CONNECTION_STRING

# Set the query
query = """
SELECT COUNT(*) AS count
FROM information_schema.tables
WHERE table_schema = 'public';
"""

# Execute the query
%sql $query

 * postgresql://postgres:***@localhost:5432/pagila
1 rows affected.

[(27,)]

#### With psycopg2

In [6]:
# Connect to the database via PSYCOPG2
connection = pg.connect(
    host=DB_INFO['host'],
    port=DB_INFO['port'],
    database=DB_INFO['database'],
    user=DB_INFO['user'],
    password=DB_INFO['password']
)

# Get cursor
cursor = connection.cursor()

# Execute the query
cursor.execute(query)

# Get table count
table_count = cursor.fetchone()[0]
print("table_count", table_count)

# Close connection
cursor.close()
connection.close()

table_count 27

#### With sqlalchemy

In [7]:
# Connect to the database via SQLAlchemy
ENGINE = create_engine(ENGINE_STRING)

# Helper functions
def get_df_from_query(engine: Engine, query: str) -> pd.DataFrame:
    with engine.connect() as conn:
        df = pd.read_sql(sql=text(query), con=conn)
    return df

def get_string_from_query(engine: Engine, query: str) -> None:
    df = get_df_from_query(engine, query)
    return df.to_string(index=None)

# Get table count
print(get_string_from_query(ENGINE, query))

 count
    27

### Exploration
#### How many rows and columns are there in selected tables?

In [8]:
# Helper function
def get_table_count(engine: Engine, table_name: str):
    query = f"""
    SELECT COUNT(*) AS count
    FROM {table_name};
    """
    return f"{table_name}: {get_df_from_query(engine, query).values[0][0]}"

# Get table counts
for table_name in ["film", "customer", "rental", "payment", "staff", "store", "city", "country"]:
    print(get_table_count(ENGINE, table_name))

film: 1000
customer: 599
rental: 16044
payment: 16049
staff: 2
store: 2
city: 600
country: 109

#### What time periode is covered by the data?

In [9]:
# Set the query
query = """
SELECT min(payment_date) as start, max(payment_date) as end from payment;
"""

# Get the start and end dates
print(get_string_from_query(ENGINE, query))

                           start                              end
2017-01-24 20:21:56.996577+00:00 2017-05-14 11:44:29.996577+00:00

#### Where do events occur?

In [10]:
# Set the query
query = """
SELECT district, count(district) as n
FROM address
GROUP BY district
ORDER BY n DESC LIMIT 10;
"""

# Get the top 10 districts
print(get_string_from_query(ENGINE, query))

         district   n
     Buenos Aires  10
         Shandong   9
       California   9
     West Bengali   9
    Uttar Pradesh   8
         So Paulo   8
          England   7
      Maharashtra   7
 Southern Tagalog   6
             Gois   5

#### What are the top grossing movies?
- Payments amounts are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` item and `inventory` item refers to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

In [11]:
query = """
SELECT 
    film.film_id AS ID, 
    film.title, 
    sum(payment.amount) AS gross_revenue
FROM payment
LEFT JOIN rental ON payment.rental_id = rental.rental_id
LEFT JOIN inventory ON rental.inventory_id = inventory.inventory_id
LEFT JOIN film ON inventory.film_id = film.film_id
GROUP BY film.film_id
ORDER BY gross_revenue DESC
LIMIT 10;
"""

get_df_from_query(ENGINE, query)

     id              title  gross_revenue
0   879   TELEGRAPH VOYAGE         231.73
1   973          WIFE TURN         223.69
2  1000          ZORRO ARK         214.69
3   369  GOODFELLAS SALUTE         209.69
4   764     SATURDAY LAMBS         204.72
5   893        TITANS JERK         201.71
6   897       TORQUE BOUND         198.72
7   403        HARRY IDAHO         195.70
8   460     INNOCENT USUAL         191.74
9   444      HUSTLER PARTY         190.78

#### Top grossing cities?

In [12]:
query = """
SELECT 
    city.city,
    sum(amount) AS gross_revenue
FROM payment
JOIN customer ON payment.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city ON address.city_id = city.city_id
GROUP BY city.city
ORDER BY gross_revenue DESC
LIMIT 10;
"""

get_df_from_query(ENGINE, query)

                  city  gross_revenue
0           Cape Coral         221.55
1          Saint-Denis         216.54
2               Aurora         198.50
3            Molodetno         195.58
4  Santa Brbara dOeste         194.61
5            Apeldoorn         194.61
6              Qomsheh         186.62
7               London         180.52
8     Ourense (Orense)         177.60
9              Bijapur         175.61

#### What is the revenue of a movie by customer city and by month?

In [13]:
query = """
SELECT
    film.title,
    city.city,
    EXTRACT(month FROM payment_date) AS month,
    sum(amount) AS gross_revenue
FROM payment
JOIN rental ON payment.rental_id = rental.rental_id
JOIN inventory ON rental.inventory_id = inventory.inventory_id
JOIN film ON inventory.film_id = film.film_id
JOIN customer ON payment.customer_id = customer.customer_id
JOIN address ON customer.address_id = address.address_id
JOIN city ON address.city_id = city.city_id
GROUP BY film.title, city.city, month
ORDER BY month, gross_revenue DESC
"""

get_df_from_query(ENGINE, query)

                   title          city  month  gross_revenue
0              SHOW LORD      Mannheim    1.0          11.99
1        AMERICAN CIRCUS        Callao    1.0          10.99
2          KISSING DOLLS        Toulon    1.0          10.99
3      CASUALTIES ENCINO        Warren    1.0          10.99
4       TELEGRAPH VOYAGE   Naala-Porto    1.0          10.99
...                  ...           ...    ...            ...
15987      MINORITY KISS    Battambang    5.0           0.00
15988    HOLES BRANNIGAN  Kakamigahara    5.0           0.00
15989    VANISHED GARDEN      Fengshan    5.0           0.00
15990       BLADE POLISH         Merlo    5.0           0.00
15991      HALF OUTFIELD        Yaound    5.0           0.00

[15992 rows x 4 columns]

### Create Star Schema

From the 3NF, we aim to transform it into a star schema like this:

<img src="../../images/pagila-star.png"  width="400">

To do this, we first explore how the data looks like:

##### Data for dimDate

In [14]:
# Explore data types
data_type_query = """
SELECT 
    table_name AS table, 
    column_name AS column, 
    data_type AS type, 
    is_nullable AS nullable, 
    column_default AS default, 
    character_maximum_length AS max_length
FROM information_schema.columns
"""

conditional_query = """ 
WHERE 
    table_name = 'payment' AND column_name = 'payment_date';
"""

get_df_from_query(ENGINE, data_type_query + conditional_query).sort_values(["table", "column"]).set_index(["table", "column"]).fillna("")

                                          type nullable default max_length
table   column
payment payment_date  timestamp with time zone       NO

In [15]:
# Set the query for data
dimDate_select_query = """
SELECT 
    DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
    DATE(payment_date)                                           AS date,
    EXTRACT(year FROM payment_date)                              AS year,
    EXTRACT(quarter FROM payment_date)                           AS quarter,
    EXTRACT(month FROM payment_date)                             AS month,
    EXTRACT(day FROM payment_date)                               AS day,
    EXTRACT(week FROM payment_date)                              AS week,
    CASE 
        WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) 
        THEN true 
        ELSE false END 
    AS is_weekend
FROM payment;
"""

get_df_from_query(ENGINE, dimDate_select_query).set_index("date_key").head()

                date    year  quarter  month   day  week  is_weekend
date_key
20170430  2017-04-30  2017.0      2.0    4.0  30.0  17.0        True
20170412  2017-04-12  2017.0      2.0    4.0  12.0  15.0       False
20170302  2017-03-02  2017.0      1.0    3.0   2.0   9.0       False
20170131  2017-01-31  2017.0      1.0    1.0  31.0   5.0       False
20170126  2017-01-26  2017.0      1.0    1.0  26.0   4.0       False

In [16]:
# Drop the table if it exists
dimDate_drop_query = """
DROP TABLE IF EXISTS dimdate CASCADE;
"""

# Execute the drop query with psycopg2
connection = pg.connect(
    host=DB_INFO['host'],
    port=DB_INFO['port'],
    database=DB_INFO['database'],
    user=DB_INFO['user'],
    password=DB_INFO['password']
)

# Get cursor
cursor = connection.cursor()

# Execute the query
cursor.execute(dimDate_drop_query)

# Create the table
dimDate_create_query = """
CREATE TABLE IF NOT EXISTS dimdate (
    date_key    SERIAL      NOT NULL      PRIMARY KEY,
    date        DATE        NOT NULL,
    year        SMALLINT    NOT NULL,
    quarter     SMALLINT    NOT NULL,
    month       SMALLINT    NOT NULL,
    day         SMALLINT    NOT NULL,
    week        SMALLINT    NOT NULL,
    is_weekend  BOOLEAN     NOT NULL
)
"""

# Execute the create query with psycopg2
cursor.execute(dimDate_create_query)

# Commit the changes
connection.commit()

# Close connection
cursor.close()
connection.close()

##### Data for dimCustomer

In [17]:
# Explore data types
conditional_query = """
WHERE 
    (
        table_name = 'customer' AND 
        (
            column_name = 'customer_id' OR
            column_name = 'first_name' OR
            column_name = 'last_name' OR
            column_name = 'email' OR
            column_name = 'active' OR
            column_name = 'create_date' OR
            column_name = 'address_id'
        )
    ) OR 
    (   
        table_name = 'address' AND 
        (
            column_name = 'address_id' OR
            column_name = 'address' OR
            column_name = 'address2' OR
            column_name = 'district' OR
            column_name = 'postal_code' OR
            column_name = 'phone'
        )
    ) OR (
        table_name = 'city' AND
        (
            column_name = 'city_id' OR
            column_name = 'city'
        )
    ) OR (
        table_name = 'country' AND
        (
            column_name = 'country_id' OR
            column_name = 'country'
        )
    );
"""

get_df_from_query(ENGINE, data_type_query + conditional_query).sort_values(["table", "column"]).set_index(["table", "column"]).fillna("")

                          type nullable  \
table    column
address  address          text       NO
         address2         text      YES
         address_id    integer       NO
         district         text       NO
         phone            text       NO
         postal_code      text      YES
city     city             text       NO
         city_id       integer       NO
country  country          text       NO
         country_id    integer       NO
customer active        integer      YES
         address_id   smallint       NO
         create_date      date       NO
         customer_id   integer       NO
         email            text      YES
         first_name       text       NO
         last_name        text       NO

                                                             default  \
table    column
address  address
         address2
         address_id      nextval('address_address_id_seq'::regclass)
         district
         phone
         postal_code
city     city
         city_id               nextval('city_city_id_seq'::regclass)
country  country
         country_id      nextval('country_country_id_seq'::regclass)
customer active
         address_id
         create_date                             ('now'::text)::date
         customer_id  nextval('customer_customer_id_seq1'::regclass)
         email
         first_name
         last_name

                     max_length
table    column
address  address
         address2
         address_id
         district
         phone
         postal_code
city     city
         city_id
country  country
         country_id
customer active
         address_id
         create_date
         customer_id
         email
         first_name
         last_name

In [18]:
# Set the query for data
dimCustomer_select_query = """
SELECT
    customer.customer_id AS customer_key,
    customer.customer_id,
    customer.first_name,
    customer.last_name,
    customer.email,
    address.address,
    address.address2,
    address.district,
    city.city,
    country.country,
    address.postal_code,
    address.phone,
    customer.active,
    customer.create_date,
    now() as start_date,
    now() as end_date
FROM 
    customer
    LEFT JOIN address ON (customer.address_id = address.address_id)
    LEFT JOIN city ON (address.city_id = city.city_id)
    LEFT JOIN country ON (city.country_id = country.country_id)
"""

get_df_from_query(ENGINE, dimCustomer_select_query).set_index("customer_id").head()

,customer_key,first_name,last_name,email,address,address2,district,city,country,postal_code,phone,active,create_date,start_date,end_date
customer_id,,,,,,,,,,,,,,,
1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1913 Hanoi Way,,Nagasaki,Sasebo,Japan,35200,28303384290,1,2017-02-14,2023-03-07 22:58:03.428203+00:00,2023-03-07 22:58:03.428203+00:00
2,2,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1121 Loja Avenue,,California,San Bernardino,United States,17886,838635286649,1,2017-02-14,2023-03-07 22:58:03.428203+00:00,2023-03-07 22:58:03.428203+00:00
3,3,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,692 Joliet Street,,Attika,Athenai,Greece,83579,448477190408,1,2017-02-14,2023-03-07 22:58:03.428203+00:00,2023-03-07 22:58:03.428203+00:00
4,4,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,1566 Inegl Manor,,Mandalay,Myingyan,Myanmar,53561,705814003527,1,2017-02-14,2023-03-07 22:58:03.428203+00:00,2023-03-07 22:58:03.428203+00:00
5,5,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,53 Idfu Parkway,,Nantou,Nantou,Taiwan,42399,10655648674,1,2017-02-14,2023-03-07 22:58:03.428203+00:00,2023-03-07 22:58:03.428203+00:00

In [19]:
# Drop the table if it exists
dimCustomer_drop_query = """
DROP TABLE IF EXISTS dimcustomer CASCADE;
"""

# Execute the drop query with psycopg2
connection = pg.connect(
    host=DB_INFO['host'],
    port=DB_INFO['port'],
    database=DB_INFO['database'],
    user=DB_INFO['user'],
    password=DB_INFO['password']
)

# Get cursor
cursor = connection.cursor()

# Execute the query
cursor.execute(dimCustomer_drop_query)

# Create the table
dimCustomer_create_query = """
CREATE TABLE IF NOT EXISTS dimcustomer (
    customer_key    SERIAL      PRIMARY KEY,
    customer_id     INTEGER     NOT NULL,
    first_name      TEXT        NOT NULL,
    last_name       TEXT        NOT NULL,
    email           TEXT,
    address         TEXT        NOT NULL,
    address2        TEXT,
    district        TEXT        NOT NULL,
    city            TEXT        NOT NULL,
    country         TEXT        NOT NULL,
    postal_code     TEXT,
    phone           TEXT        NOT NULL,
    active          SMALLINT,
    create_date     DATE        NOT NULL,
    start_date      DATE        NOT NULL,
    end_date        DATE        NOT NULL
);
"""

# Execute the create query with psycopg2
cursor.execute(dimCustomer_create_query)

# Commit the changes
connection.commit()

# Close connection
cursor.close()
connection.close()

##### Data for dimStore

In [20]:
# Explore data types
conditional_query = """
WHERE 
    (
        table_name = 'store' AND 
        (
            column_name = 'store_id'
        )
    ) OR 
    (   
        table_name = 'staff' AND 
        (
            column_name = 'staff_id' OR
            column_name = 'first_name' OR
            column_name = 'last_name' 
        )
    );
"""

get_df_from_query(ENGINE, data_type_query + conditional_query).sort_values(["table", "column"]).set_index(["table", "column"]).fillna("")

                     type nullable                                  default  \
table column
staff first_name     text       NO
      last_name      text       NO
      staff_id    integer       NO  nextval('staff_staff_id_seq'::regclass)
store store_id    integer       NO  nextval('store_store_id_seq'::regclass)

                 max_length
table column
staff first_name
      last_name
      staff_id
store store_id

In [21]:
# Set the query for data
dimStore_select_query = """
SELECT
    store.store_id AS store_key,
    store.store_id,
    address.address,
    address.address2,
    address.district,
    city.city,
    country.country,
    address.postal_code,
    staff.first_name AS manager_first_name,
    staff.last_name AS manager_last_name,
    now() as start_date,
    now() as end_date
FROM 
    store
    LEFT JOIN address ON (store.address_id = address.address_id)
    LEFT JOIN city ON (address.city_id = city.city_id)
    LEFT JOIN country ON (city.country_id = country.country_id)
    LEFT JOIN staff ON (store.manager_staff_id = staff.staff_id)
"""

get_df_from_query(ENGINE, dimStore_select_query).set_index("store_id").head()

,store_key,address,address2,district,city,country,postal_code,manager_first_name,manager_last_name,start_date,end_date
store_id,,,,,,,,,,,
1,1,47 MySakila Drive,None,Alberta,Lethbridge,Canada,,Mike,Hillyer,2023-03-07 22:58:03.700494+00:00,2023-03-07 22:58:03.700494+00:00
2,2,28 MySQL Boulevard,None,QLD,Woodridge,Australia,,Jon,Stephens,2023-03-07 22:58:03.700494+00:00,2023-03-07 22:58:03.700494+00:00

In [22]:
# Drop the table if it exists
dimStore_drop_query = """
DROP TABLE IF EXISTS dimstore CASCADE;
"""

# Execute the drop query with psycopg2
connection = pg.connect(
    host=DB_INFO['host'],
    port=DB_INFO['port'],
    database=DB_INFO['database'],
    user=DB_INFO['user'],
    password=DB_INFO['password']
)

# Get cursor
cursor = connection.cursor()

# Execute the query
cursor.execute(dimStore_drop_query)

# Create the table
dimStore_create_query = """
CREATE TABLE IF NOT EXISTS dimstore (
    store_key           SERIAL      PRIMARY KEY,
    store_id            INTEGER     NOT NULL,
    address             TEXT        NOT NULL,
    address2            TEXT,
    district            TEXT        NOT NULL,
    city                TEXT        NOT NULL,
    country             TEXT        NOT NULL,
    postal_code         TEXT,
    manager_first_name  TEXT        NOT NULL,
    manager_last_name   TEXT        NOT NULL,
    start_date          DATE        NOT NULL ,
    end_date            DATE        NOT NULL
);
"""

# Execute the create query with psycopg2
cursor.execute(dimStore_create_query)

# Commit the changes
connection.commit()

# Close connection
cursor.close()
connection.close()

##### Data for dimMovie

In [23]:
conditional_query = """
WHERE 
    (
        table_name = 'film' AND 
        (
            column_name = 'film_id' OR
            column_name = 'title' OR
            column_name = 'description' OR
            column_name = 'release_year' OR
            column_name = 'rental_duration' OR
            column_name = 'length' OR
            column_name = 'rating' OR
            column_name = 'special_features' OR
            column_name = 'language_id' OR
            column_name = 'original_language_id' 
        )
    ) OR 
    (   
        table_name = 'language' AND 
        (
            column_name = 'name' OR
            column_name = 'language_id'
        )
    );
"""

get_df_from_query(ENGINE, data_type_query + conditional_query).sort_values(["table", "column"]).set_index(["table", "column"]).fillna("")

                                       type nullable  \
table    column
film     description                   text      YES
         film_id                    integer       NO
         language_id               smallint       NO
         length                    smallint      YES
         original_language_id      smallint      YES
         rating                USER-DEFINED      YES
         release_year               integer      YES
         rental_duration           smallint       NO
         special_features             ARRAY      YES
         title                         text       NO
language language_id                integer       NO
         name                     character       NO

                                                                     default  \
table    column
film     description
         film_id                       nextval('film_film_id_seq'::regclass)
         language_id
         length
         original_language_id
         rating                                             'G'::mpaa_rating
         release_year
         rental_duration                                                   3
         special_features
         title
language language_id           nextval('language_language_id_seq'::regclass)
         name

                              max_length
table    column
film     description
         film_id
         language_id
         length
         original_language_id
         rating
         release_year
         rental_duration
         special_features
         title
language language_id
         name                       20.0

In [24]:
dimMovie_select_query = """
SELECT
    film.film_id AS movie_key,
    film.film_id,
    film.title,
    film.description,
    film.release_year,
    this_language.name AS language,
    orig_language.name AS original_language,
    film.rental_duration,
    film.length,
    film.rating,
    film.special_features
FROM
    film
    LEFT JOIN language AS this_language ON (film.language_id = this_language.language_id)
    LEFT JOIN language AS orig_language ON (film.original_language_id = orig_language.language_id)
"""

get_df_from_query(ENGINE, dimMovie_select_query).set_index("film_id").head()

,movie_key,title,description,release_year,language,original_language,rental_duration,length,rating,special_features
film_id,,,,,,,,,,
1,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,English,None,6,86,PG,"[Deleted Scenes, Behind the Scenes]"
2,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,English,None,3,48,G,"[Trailers, Deleted Scenes]"
3,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,English,None,7,50,NC-17,"[Trailers, Deleted Scenes]"
4,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,English,None,5,117,G,"[Commentaries, Behind the Scenes]"
5,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,English,None,6,130,G,[Deleted Scenes]

In [25]:
# Drop the table if it exists
dimMovie_drop_query = """
DROP TABLE IF EXISTS dimmovie CASCADE;
"""

# Execute the drop query with psycopg2
connection = pg.connect(
    host=DB_INFO['host'],
    port=DB_INFO['port'],
    database=DB_INFO['database'],
    user=DB_INFO['user'],
    password=DB_INFO['password']
)

# Get cursor
cursor = connection.cursor()

# Execute the query
cursor.execute(dimMovie_drop_query)

# Create the table
dimMovie_create_query = """
CREATE TABLE IF NOT EXISTS dimmovie (
    movie_key           SERIAL      PRIMARY KEY,
    film_id             INTEGER     NOT NULL,
    title               TEXT        NOT NULL,
    description         TEXT        NOT NULL,
    release_year        INTEGER,
    language            TEXT        NOT NULL,
    original_language   TEXT,
    rental_duration     INTEGER     NOT NULL,
    length              INTEGER,
    rating              TEXT        NOT NULL,
    special_features    TEXT        NOT NULL
)
"""

# Execute the create query with psycopg2
cursor.execute(dimMovie_create_query)

# Commit the changes
connection.commit()

# Close connection
cursor.close()
connection.close()

##### Data for factSales

In [26]:
factSales_select_query = """
SELECT
    TO_CHAR(payment.payment_date :: DATE, 'yyyyMMDD')::integer AS date_key,
    payment.customer_id AS customer_key,
    store.store_id AS store_key,
    film.film_id AS movie_key,
    payment.amount AS sales_amount
FROM
    payment
    LEFT JOIN rental ON (payment.rental_id = rental.rental_id)
    LEFT JOIN inventory ON (rental.inventory_id = inventory.inventory_id)
    LEFT JOIN film ON (inventory.film_id = film.film_id)
    LEFT JOIN store ON (inventory.store_id = store.store_id)
"""

get_df_from_query(ENGINE, factSales_select_query).set_index("date_key").head()

          customer_key  store_key  movie_key  sales_amount
date_key
20170124           269          2        870          1.99
20170125           269          1        651          0.99
20170128           269          1        818          6.99
20170129           269          2        249          0.99
20170129           269          2        159          4.99

In [27]:
# Drop the table if it exists
factSales_drop_query = """
DROP TABLE IF EXISTS factsales CASCADE;
"""

# Execute the drop query with psycopg2
connection = pg.connect(
    host=DB_INFO['host'],
    port=DB_INFO['port'],
    database=DB_INFO['database'],
    user=DB_INFO['user'],
    password=DB_INFO['password']
)

# Get cursor
cursor = connection.cursor()

# Execute the query
cursor.execute(factSales_drop_query)

# Create the table
factSales_create_query = """
CREATE TABLE IF NOT EXISTS factsales (
    sales_key       SERIAL      PRIMARY KEY,
    date_key        INTEGER     NOT NULL    REFERENCES dimdate(date_key),
    customer_key    INTEGER     NOT NULL    REFERENCES dimcustomer(customer_key),
    store_key       INTEGER     NOT NULL    REFERENCES dimstore(store_key),
    movie_key       INTEGER     NOT NULL    REFERENCES dimmovie(movie_key),
    sales_amount    NUMERIC     NOT NULL
)
"""

# Execute the create query with psycopg2
cursor.execute(factSales_create_query)

# Commit the changes
connection.commit()

# Close connection
cursor.close()
connection.close()

#### Insert data

In [28]:
insert_into_dimDate_query = """
INSERT INTO dimdate (
    date_key,
    date,
    year,
    quarter,
    month,
    day,
    week,
    is_weekend
) VALUES (%s, %s, %s, %s, %s, %s, %s, %s)
"""

insert_into_dimCustomer_query = """
INSERT INTO dimcustomer (
    customer_key,
    customer_id,
    first_name,
    last_name,
    email,
    address,
    address2,
    district,
    city,
    country,
    postal_code,
    phone,
    active,
    create_date,
    start_date,
    end_date
)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
"""

insert_into_dimStore_query = """
INSERT INTO dimstore (
    store_key,
    store_id,
    address,
    address2,
    district,
    city,
    country,
    postal_code,
    manager_first_name,
    manager_last_name,
    start_date,
    end_date
) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
"""

insert_into_dimMovie_query = """
INSERT INTO dimmovie (
    movie_key,
    film_id,
    title,
    description,
    release_year,
    language,
    original_language,
    rental_duration,
    length,
    rating,
    special_features
) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
"""

insert_into_factSales_query = """
INSERT INTO factsales (
    date_key,
    customer_key,
    store_key,
    movie_key,
    sales_amount
) VALUES (%s, %s, %s, %s, %s)
"""

# Execute the insert query with psycopg2
connection = pg.connect(
    host=DB_INFO['host'],
    port=DB_INFO['port'],
    database=DB_INFO['database'],
    user=DB_INFO['user'],
    password=DB_INFO['password']
)

# Get cursor
cursor = connection.cursor()

# Execute the queries
cursor.execute(dimDate_select_query)
for row in cursor.fetchall():
    cursor.execute(insert_into_dimDate_query, row)

cursor.execute(dimCustomer_select_query)
for row in cursor.fetchall():
    cursor.execute(insert_into_dimCustomer_query, row)

cursor.execute(dimStore_select_query)
for row in cursor.fetchall():
    cursor.execute(insert_into_dimStore_query, row)

cursor.execute(dimMovie_select_query)
for row in cursor.fetchall():
    cursor.execute(insert_into_dimMovie_query, row)

cursor.execute(factSales_select_query)
for row in cursor.fetchall():
    cursor.execute(insert_into_factSales_query, row)

# Commit the changes
connection.commit()

# Close connection
cursor.close()
connection.close()

### Revisit the questions

#### What are the top grossing movies?

In [29]:
query = """
SELECT
    dimmovie.title,
    sum(sales_amount) AS total_sales
FROM
    factsales
    LEFT JOIN dimmovie ON (factsales.movie_key = dimmovie.movie_key)
GROUP BY
    dimmovie.title
ORDER BY
    total_sales DESC
LIMIT 10
"""

get_df_from_query(ENGINE, query).set_index("title")

                   total_sales
title
TELEGRAPH VOYAGE        231.73
WIFE TURN               223.69
ZORRO ARK               214.69
GOODFELLAS SALUTE       209.69
SATURDAY LAMBS          204.72
TITANS JERK             201.71
TORQUE BOUND            198.72
HARRY IDAHO             195.70
INNOCENT USUAL          191.74
HUSTLER PARTY           190.78

#### Top grossing cities?

In [30]:
query = """
SELECT
    dimcustomer.city,
    sum(sales_amount) AS total_sales
FROM
    factsales
    LEFT JOIN dimcustomer ON (factsales.customer_key = dimcustomer.customer_key)
GROUP BY
    dimcustomer.city
ORDER BY
    total_sales DESC
LIMIT 10
"""

get_df_from_query(ENGINE, query).set_index("city")

                     total_sales
city
Cape Coral                221.55
Saint-Denis               216.54
Aurora                    198.50
Molodetno                 195.58
Santa Brbara dOeste       194.61
Apeldoorn                 194.61
Qomsheh                   186.62
London                    180.52
Ourense (Orense)          177.60
Bijapur                   175.61

#### What is the revenue of a movie by customer city and by month?

In [31]:
query = """
SELECT
    dimmovie.title,
    dimdate.month,
    dimcustomer.city,
    sum(sales_amount) AS total_sales
FROM
    factsales
    LEFT JOIN dimmovie ON (factsales.movie_key = dimmovie.movie_key)
    LEFT JOIN dimdate ON (factsales.date_key = dimdate.date_key)
    LEFT JOIN dimcustomer ON (factsales.customer_key = dimcustomer.customer_key)
GROUP BY
    dimmovie.title,
    dimdate.month,
    dimcustomer.city
ORDER BY
    total_sales DESC,
    dimmovie.title,
    dimdate.month,
    dimcustomer.city
"""

get_df_from_query(ENGINE, query)

                      title  month                 city  total_sales
0         CARIBBEAN LIBERTY      4               Ibirit        16.98
1              EAGLES PANKY      3               Datong        16.98
2                 LUST LOCK      4        Coatzacoalcos        15.98
3      BREAKFAST GOLDFINGER      4                  Ife        13.98
4            INNOCENT USUAL      2             Valparai        13.98
...                     ...    ...                  ...          ...
15987       STATE WASTELAND      5             Erlangen         0.00
15988      TITANIC BOONDOCK      5           Santo Andr         0.00
15989          TROUBLE DATE      5             Changhwa         0.00
15990       VANISHED GARDEN      5             Fengshan         0.00
15991          WOMEN DORADO      5  Aparecida de Goinia         0.00

[15992 rows x 4 columns]

### Working on OLAP cubes

#### Roll-up
- Stepping up the level of aggregation to a large grouping
- e.g.`city` is summed as `country`

**Task**  
Write a query that calculates revenue (sales_amount) by day, rating, and country. Sort the data by revenue in descending order, and limit the data to the top 20 results.

In [32]:
query = """
SELECT
    dimdate.day,
    dimmovie.rating,
    dimcustomer.country,
    sum(sales_amount) AS total_sales
FROM
    factsales
    LEFT JOIN dimdate ON (factsales.date_key = dimdate.date_key)
    LEFT JOIN dimmovie ON (factsales.movie_key = dimmovie.movie_key)
    LEFT JOIN dimcustomer ON (factsales.customer_key = dimcustomer.customer_key)
GROUP BY
    dimdate.day,
    dimmovie.rating,
    dimcustomer.country
ORDER BY
    total_sales DESC
LIMIT 20;
"""

get_df_from_query(ENGINE, query).set_index(["day", "rating", "country"])

                          total_sales
day rating country
30  G      China               169.67
    PG     India               156.67
    NC-17  India               153.64
    PG-13  China               146.67
    R      China               145.66
           India               143.68
    G      India               137.67
18  NC-17  India               135.75
30  PG     China               131.72
21  PG-13  India               128.74
18  PG-13  India               121.72
    PG     India               119.76
30  PG-13  India               116.72
21  NC-17  China               115.77
    R      India               115.75
27  NC-17  India               115.72
17  PG-13  China               111.75
    NC-17  United States       109.76
30  NC-17  China               108.77
20  PG-13  India               101.79

#### Drill-down
- Breaking up one of the dimensions to a lower level.
- e.g.`city` is broken up into  `districts`

**Task**  
Write a query that calculates revenue (sales_amount) by day, rating, and district. Sort the data by revenue in descending order, and limit the data to the top 20 results.

In [33]:
query = """
SELECT
    dimdate.day,
    dimmovie.rating,
    dimcustomer.district,
    SUM(sales_amount) AS revenue
FROM
    factsales
    LEFT JOIN dimdate ON (factsales.date_key = dimdate.date_key)
    LEFT JOIN dimmovie ON (factsales.movie_key = dimmovie.movie_key)
    LEFT JOIN dimcustomer ON (factsales.customer_key = dimcustomer.customer_key)
GROUP BY
    dimdate.day,
    dimmovie.rating,
    dimcustomer.district
ORDER BY
    revenue DESC
LIMIT 20;
"""

get_df_from_query(ENGINE, query).set_index(["day", "rating", "district"])

                             revenue
day rating district
30  PG-13  Southern Tagalog    53.88
    G      Inner Mongolia      38.93
           Shandong            36.93
    NC-17  West Bengali        36.92
17  PG-13  Shandong            34.95
1   PG     California          32.94
18  NC-17  So Paulo            32.93
21  R      So Paulo            31.93
30  NC-17  Buenos Aires        31.93
    PG     Southern Tagalog    30.94
           So Paulo            30.93
    R      Buenos Aires        30.92
18  NC-17  Maharashtra         29.95
30  G      California          29.95
21  PG-13  Uttar Pradesh       29.94
10  R      Maharashtra         29.93
20  PG     Shandong            29.93
18  R      Sumy                28.97
21  PG-13  Southern Tagalog    28.96
29  NC-17  So Paulo            28.95

#### Slicing

Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2, fixing one of the dimensions to a single value. In the example above, we have a 3-dimensional cube on day, rating, and country.

**Task**   
Write a query that reduces the dimensionality of the above example by limiting the results to only include movies with a `rating` of "PG-13". Again, sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [34]:
query = """
SELECT
    dimdate.day,
    dimmovie.rating,
    dimcustomer.city,
    SUM(sales_amount) AS revenue
FROM
    factsales
    LEFT JOIN dimdate ON (factsales.date_key = dimdate.date_key)
    LEFT JOIN dimmovie ON (factsales.movie_key = dimmovie.movie_key)
    LEFT JOIN dimcustomer ON (factsales.customer_key = dimcustomer.customer_key)
GROUP BY
    dimdate.day,
    dimmovie.rating,
    dimcustomer.city
HAVING
    dimmovie.rating = 'PG-13'
ORDER BY
    revenue DESC
LIMIT 20;
"""

get_df_from_query(ENGINE, query).set_index(["day", "rating", "city"])

                        revenue
day rating city
30  PG-13  Zanzibar       21.97
28  PG-13  Dhaka          19.97
29  PG-13  Shimoga        18.97
30  PG-13  Osmaniye       18.97
21  PG-13  Asuncin        18.95
           Parbhani       17.98
20  PG-13  Baha Blanca    17.98
30  PG-13  Nagareyama     17.98
           Tanauan        17.96
17  PG-13  Ikerre         17.95
30  PG-13  Zhoushan       16.98
           Newcastle      16.97
           Yerevan        16.97
17  PG-13  Yantai         15.98
30  PG-13  Santa Rosa     15.98
20  PG-13  Santa Rosa     15.98
8   PG-13  Pontianak      15.98
10  PG-13  Udaipur        15.97
1   PG-13  Moscow         15.97
23  PG-13  Tiefa          15.97

#### Dicing
Dicing is creating a subcube with the same dimensionality but fewer values for  two or more dimensions. 

**Task**   
Write a query to create a subcube of the initial cube that includes moves with:
- ratings of PG or PG-13
- in the city of Bellevue or Lancaster
- day equal to 1, 15, or 30

In [35]:
query = query = """
SELECT
    dimdate.day,
    dimmovie.rating,
    dimcustomer.city,
    SUM(sales_amount) AS revenue
FROM
    factsales
    LEFT JOIN dimdate ON (factsales.date_key = dimdate.date_key)
    LEFT JOIN dimmovie ON (factsales.movie_key = dimmovie.movie_key)
    LEFT JOIN dimcustomer ON (factsales.customer_key = dimcustomer.customer_key)
GROUP BY
    dimdate.day,
    dimmovie.rating,
    dimcustomer.city
HAVING
    (
        dimmovie.rating in ('PG-13', 'PG') AND
        dimcustomer.city in ('Bellevue', 'Lancaster') AND
        dimdate.day in (1, 15, 30)
    )
ORDER BY
    revenue DESC
LIMIT 20;
"""

get_df_from_query(ENGINE, query).set_index(["day", "rating", "city"])

                      revenue
day rating city
30  PG     Lancaster    12.98
1   PG-13  Lancaster     5.99
30  PG-13  Bellevue      3.99
           Lancaster     2.99
15  PG-13  Bellevue      1.98
1   PG     Bellevue      0.99

#### Working with Grouping Sets

In [36]:
query = query = """
SELECT
    dimdate.day,
    dimmovie.rating,
    dimcustomer.city,
    SUM(sales_amount) AS revenue
FROM
    factsales
    LEFT JOIN dimdate ON (factsales.date_key = dimdate.date_key)
    LEFT JOIN dimmovie ON (factsales.movie_key = dimmovie.movie_key)
    LEFT JOIN dimcustomer ON (factsales.customer_key = dimcustomer.customer_key)
GROUP BY
    Grouping Sets (
        (), 
        dimdate.day, 
        dimmovie.rating, 
        dimcustomer.city, 
        (dimdate.day, dimmovie.rating), 
        (dimdate.day, dimcustomer.city), 
        (dimmovie.rating, dimcustomer.city), 
        (dimdate.day, dimmovie.rating, dimcustomer.city)
    )
HAVING
    (
        dimmovie.rating in ('PG-13', 'PG') AND
        dimcustomer.city in ('Bellevue', 'Lancaster')
    )
"""

get_df_from_query(ENGINE, query).set_index(["day", "rating", "city"])

                       revenue
day  rating city
1.0  PG     Bellevue      0.99
     PG-13  Lancaster     5.99
8.0  PG     Bellevue     14.98
9.0  PG     Lancaster     4.99
     PG-13  Bellevue      6.99
15.0 PG-13  Bellevue      1.98
16.0 PG     Bellevue      2.99
     PG-13  Lancaster     4.99
17.0 PG-13  Lancaster     3.99
19.0 PG-13  Bellevue      9.99
20.0 PG     Lancaster     5.99
     PG-13  Lancaster    11.98
21.0 PG     Bellevue      2.99
22.0 PG-13  Lancaster     4.99
23.0 PG-13  Bellevue      4.99
27.0 PG-13  Lancaster     0.99
28.0 PG     Lancaster     4.99
30.0 PG     Lancaster    12.98
     PG-13  Bellevue      3.99
            Lancaster     2.99
NaN  PG-13  Bellevue     27.94
     PG     Bellevue     21.95
     PG-13  Lancaster    35.92
     PG     Lancaster    28.95

#### Working with Cube Function

In [37]:
query = """
SELECT 
    dimDate.month,
    dimStore.country,
    sum(sales_amount) as revenue
FROM factSales
    JOIN dimDate on (dimDate.date_key = factSales.date_key)
    JOIN dimStore on (dimStore.store_key = factSales.store_key)
    GROUP by cube(dimDate.month,  dimStore.country);
"""

get_df_from_query(ENGINE, query).set_index(["month", "country"])

                  revenue
month country
NaN   NaN        67416.51
5.0   Australia    271.08
4.0   Australia  14136.07
1.0   Canada      2460.24
      Australia   2364.19
4.0   Canada     14423.39
2.0   Canada      4736.78
      Australia   4895.10
3.0   Australia  12060.33
      Canada     11826.23
5.0   Canada       243.10
3.0   NaN        23886.56
5.0   NaN          514.18
4.0   NaN        28559.46
2.0   NaN         9631.88
1.0   NaN         4824.43
NaN   Australia  33726.77
      Canada     33689.74